rule aws_noncompliance_ec2_public_ip {
  meta:
    author = "Gowthaman"
    description = "Detects EC2 instances with public IPs violating HIPAA 164.308(a)(3)(i)(ii) & 164.312(a)(1); SOC2 2017 CC5.2.3, CC6.1.3, CC6.1.7; NIST AC-3, AC-5, AC-6, MP-2"
    data_source = "GCP Security Command Center"
    severity = "High"
    compliance_standard = "HIPAA 164.308(a)(3)(i)(ii) & 164.312(a)(1); SOC2 2017 CC5.2.3, CC6.1.3, CC6.1.7, NIST AC-3, AC-5, AC-6, MP-2"

  events:
    $e.metadata.vendor_name = "Google"
    $e.metadata.product_name = "Security Command Center"
    $e.metadata.log_type = "GCP_SECURITYCENTER_MISCONFIGURATION"
    $e.metadata.product_event_type = "EC2_INSTANCE_NO_PUBLIC_IP"
    $e.security_result.severity = "HIGH"
    $e.security_result.category_details = "MISCONFIGURATION"
    $e.target.resource.attribute.labels["resource_type"] = "AWS::EC2::Instance"
    $e.target.resource.name = $resource_name
    

  match:
    $resource_name over 24h

  outcome:
    $risk_score = 70
    $description = "Detection of a high-priority compliance violation: an AWS EC2 instance has been found with a public IP address. Flagged by GCP Security Command Center, this configuration introduces a significant security risk and directly contravenes HIPAA 164.308(a)(3)(i)."
    $event_name = array_distinct($e.metadata.product_event_type)
    $principal_resource_name = array_distinct($e.principal.resource.name)
    $target_resource_name = array_distinct($e.target.resource.name)    
    $resource_display_name = array_distinct($e.target.resource.attribute.labels["resource_displayName"])
    $recipient_aws_account_id = array_distinct($e.additional.fields["recipientAccountId"])
    $aws_region = array_distinct($e.principal.location.name)
    $target_resource_product_object_id = array_distinct($e.target.resource.product_object_id)
    $recommendation = array_distinct($e.security_result.detection_fields["sourceProperties_Recommendation"])

  condition:
    $e
}
