rule gcp_service_account_creation {
  meta:
    author = "Gowthaman"
    description = "Alert triggered due to the creation of a service account by a user without using Terraform or by a SA not following terraform automation naming convention. Service accounts are critical for enabling applications and services to interact with Google Cloud resources, and their creation outside of controlled processes (such as Terraform) can indicate potential misconfigurations or unauthorized access. Immediate investigation is required to determine whether the service account creation was intentional, authorized, and follows the organization's best practices for service account management. If the service account was created without proper oversight or without following the correct provisioning workflow, take action to mitigate any security risks, such as revoking permissions or deleting the account."
    severity = "High"

  events:
($event.metadata.product_event_type = "google.iam.admin.v1.CreateServiceAccount")
 ($event.principal.user.userid !=  /terraform\W+\w+\W+\w+@.*\.iam\.gserviceaccount\.com/)
 not $event.principal.user.email_addresses = "infradeploy-*******-mgmt@******.iam.gserviceaccount.com" nocase                               

  condition:
    $event 
}
